---
kind: property
id: P:Autodesk.Revit.DB.Visual.Gradient.TextureURepeat
source: html/54b031ce-2820-8c8e-ae5d-476df996880d.htm
---
# Autodesk.Revit.DB.Visual.Gradient.TextureURepeat Property

The property labeled "U Repeat" from the "Gradient" schema.

## Syntax (C#)
```csharp
public static string TextureURepeat { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".